{
    "articles": [
        {
            "id": 1,
            "component": "ArticleProfile",
            "settings": {
                "contact_list_ids": ["address", "email", "phone"],
                "contact_circles_ids": ["github", "linkedin", "instagram", "facebook"]
            },
            "items": [
                {
                    "id": 1,
                    "locales": {
                        "en": {
                            "description": "I am a Full-Stack Developer with over ten years of experience at IBM Trusteer, specializing in cybersecurity solutions and quality assurance engineering. My journey began in Technical Support, where I developed a deep understanding of customer needs and our cybersecurity products. This foundation led me to a QA Engineer role, where I created automation testing frameworks and conducted security assessments before advancing to a strategic development team."
                        },
                        "he": {
                            "description": "אני מפתח פול-סטאק עם יותר מעשר שנות ניסיון ב-IBM Trusteer, מתמחה בפתרונות סייבר והנדסת אבטחת איכות. התחלתי את דרכי בתמיכה טכנית, שם רכשתי הבנה עמוקה של צורכי הלקוחות והמוצרים שלנו בתחום הסייבר. בסיס זה הוביל אותי לתפקיד מהנדס QA, שבו פיתחתי מסגרות אוטומציה לבדיקות וביצעתי הערכות אבטחה לפני שהתקדמתי לצוות פיתוח אסטרטגי."
                        },
                        "pt": {
                            "description": "Sou Desenvolvedor Full-Stack com mais de dez anos de experiência na IBM Trusteer, especializado em soluções de cibersegurança e engenharia de garantia de qualidade. Minha jornada começou no Suporte Técnico, onde desenvolvi um profundo entendimento das necessidades dos clientes e de nossos produtos de cibersegurança. Essa base me levou ao cargo de Engenheiro de QA, onde criei frameworks de testes automatizados e realizei avaliações de segurança antes de avançar para uma equipe de desenvolvimento estratégico."
                        },
                        "ar": {
                            "description": "أنا مطوّر فل-ستاك لدي أكثر من عشر سنوات من الخبرة في IBM Trusteer، متخصص في حلول الأمن السيبراني وهندسة ضمان الجودة. بدأت رحلتي في الدعم الفني، حيث طوّرت فهماً عميقاً لاحتياجات العملاء ومنتجاتنا في مجال الأمن السيبراني. هذا الأساس قادني إلى دور مهندس ضمان الجودة، حيث أنشأت أُطر اختبار آلية وأجريت تقييمات أمنية قبل أن أتقدّم إلى فريق تطوير استراتيجي."
                        },
                        "ru": {
                            "description": "Я Full-Stack разработчик с более чем десятью годами опыта в IBM Trusteer, специализируюсь на решениях в области кибербезопасности и инженерии обеспечения качества. Мой путь начался в технической поддержке, где я получил глубокое понимание потребностей клиентов и наших продуктов по кибербезопасности. Эта основа привела меня к роли инженера QA, где я создавал фреймворки для автоматизированного тестирования и проводил оценки безопасности, прежде чем перейти в стратегическую команду разработчиков."
                        },
                        "ua": {
                            "description": "Я Full-Stack розробник із понад десятьма роками досвіду в IBM Trusteer, спеціалізуюся на рішеннях з кібербезпеки та інженерії забезпечення якості. Мій шлях почався у технічній підтримці, де я здобув глибоке розуміння потреб клієнтів і наших продуктів у сфері кібербезпеки. Ця основа привела мене до ролі інженера QA, де я створював фреймворки для автоматизованого тестування та проводив оцінки безпеки, перш ніж перейти до стратегічної команди розробки."
                        }
                    }
                },
                {
                    "id": 2,
                    "locales": {
                        "en": {
                            "description": "I focus on enhancing security infrastructure, maintaining and developing server-side logic with Python, and ensuring seamless integration with front-end interfaces. I have designed and developed robust web applications using modern technologies such as Node.js, Vue.js, and Angular. My commitment to secure coding practices has significantly reduced vulnerabilities and minimized cyber threats."
                        },
                        "he": {
                            "description": "ההתמקדות שלי היא בשיפור תשתיות האבטחה, תחזוקה ופיתוח לוגיקה בצד השרת באמצעות Python, והבטחת אינטגרציה חלקה עם ממשקי הפרונטאנד. תכננתי ופיתחתי יישומי ווב מתקדמים באמצעות טכנולוגיות מודרניות כמו Node.js, ‏Vue.js ו-Angular. המחויבות שלי לשיטות קידוד מאובטחות צמצמה באופן משמעותי פגיעויות והקטינה איומי סייבר."
                        },
                        "pt": {
                            "description": "Meu foco é aprimorar a infraestrutura de segurança, manter e desenvolver a lógica do lado do servidor com Python e garantir a integração perfeita com as interfaces de front-end. Projetei e desenvolvi aplicações web robustas utilizando tecnologias modernas como Node.js, Vue.js e Angular. Meu compromisso com práticas de codificação segura reduziu significativamente vulnerabilidades e minimizou ameaças cibernéticas."
                        },
                        "ar": {
                            "description": "أركز على تحسين بنية الأمن، وصيانة وتطوير منطق جانب الخادم باستخدام Python، وضمان التكامل السلس مع واجهات الواجهة الأمامية. لقد صممت وطوّرت تطبيقات ويب قوية باستخدام تقنيات حديثة مثل Node.js وVue.js وAngular. التزامي بممارسات البرمجة الآمنة قلّل بشكل كبير من الثغرات الأمنية وقلّص التهديدات السيبرانية."
                        },
                        "ru": {
                            "description": "Я сосредоточен на улучшении инфраструктуры безопасности, поддержке и разработке серверной логики на Python, а также на обеспечении бесшовной интеграции с интерфейсами фронтенда. Я проектировал и разрабатывал надежные веб-приложения с использованием современных технологий, таких как Node.js, Vue.js и Angular. Моя приверженность безопасным практикам программирования значительно сократила уязвимости и минимизировала киберугрозы."
                        },
                        "ua": {
                            "description": "Я зосереджуюсь на покращенні інфраструктури безпеки, підтримці та розробці серверної логіки на Python, а також на забезпеченні безшовної інтеграції з інтерфейсами фронтенду. Я проєктував і розробляв надійні вебзастосунки з використанням сучасних технологій, таких як Node.js, Vue.js та Angular. Моя відданість безпечним практикам програмування суттєво зменшила вразливості та мінімізувала кіберзагрози."
                        }
                    }
                },
                {
                    "id": 3,
                    "locales": {
                        "en": {
                            "description": "I develop and maintain systems that categorize cybersecurity threats by integrating machine learning models, enhancing real-time analytics and threat detection. My experience in developing RESTful APIs and microservices ensures efficient communication between client-side and server-side applications. Additionally, I focus on data analytics, processing, parsing, and filtering information to create functional web applications. My expertise in deploying applications on cloud platforms like AWS allows me to optimize performance while maintaining a secure infrastructure."
                        },
                        "he": {
                            "description": "אני מפתח ומתחזק מערכות שמסווגות איומי סייבר באמצעות שילוב מודלים של למידת מכונה, שיפור אנליטיקה בזמן אמת וזיהוי איומים. הניסיון שלי בפיתוח RESTful APIs ומיקרו-שירותים מבטיח תקשורת יעילה בין אפליקציות צד לקוח וצד שרת. בנוסף, אני מתמקד באנליטיקה של נתונים — עיבוד, ניתוח וסינון מידע ליצירת יישומי ווב פונקציונליים. המומחיות שלי בפריסת יישומים בפלטפורמות ענן כמו AWS מאפשרת לי לשפר ביצועים תוך שמירה על תשתית מאובטחת."
                        },
                        "pt": {
                            "description": "Desenvolvo e mantenho sistemas que categorizam ameaças de cibersegurança integrando modelos de aprendizado de máquina, aprimorando a análise em tempo real e a detecção de ameaças. Minha experiência no desenvolvimento de APIs RESTful e microsserviços garante comunicação eficiente entre aplicações cliente e servidor. Além disso, foco em análise de dados — processamento, parsing e filtragem de informações para criar aplicações web funcionais. Minha expertise em implantar aplicações em plataformas de nuvem como a AWS me permite otimizar o desempenho mantendo uma infraestrutura segura."
                        },
                        "ar": {
                            "description": "أطوّر وأُدير أنظمة تقوم بتصنيف تهديدات الأمن السيبراني من خلال دمج نماذج تعلم الآلة، وتعزيز التحليلات في الوقت الفعلي والكشف عن التهديدات. خبرتي في تطوير RESTful APIs والخدمات المصغّرة تضمن اتصالاً فعالاً بين تطبيقات جانب العميل والخادم. بالإضافة إلى ذلك، أركز على تحليلات البيانات — المعالجة، والتحليل، وتصنيف المعلومات لإنشاء تطبيقات ويب عملية. خبرتي في نشر التطبيقات على منصات سحابية مثل AWS تمكّنني من تحسين الأداء مع الحفاظ على بنية تحتية آمنة."
                        },
                        "ru": {
                            "description": "Я разрабатываю и поддерживаю системы, которые классифицируют киберугрозы с помощью интеграции моделей машинного обучения, улучшая аналитику в реальном времени и обнаружение угроз. Мой опыт разработки RESTful API и микросервисов обеспечивает эффективное взаимодействие между клиентскими и серверными приложениями. Кроме того, я сосредоточен на аналитике данных — обработке, парсинге и фильтрации информации для создания функциональных веб-приложений. Мой опыт развертывания приложений на облачных платформах, таких как AWS, позволяет оптимизировать производительность при сохранении безопасной инфраструктуры."
                        },
                        "ua": {
                            "description": "Я розробляю та підтримую системи, які класифікують кіберзагрози, інтегруючи моделі машинного навчання, покращуючи аналітику в реальному часі та виявлення загроз. Мій досвід у розробці RESTful API та мікросервісів забезпечує ефективну комунікацію між клієнтськими та серверними застосунками. Крім того, я зосереджуюсь на аналітиці даних — обробці, парсингу та фільтрації інформації для створення функціональних вебзастосунків. Мій досвід у розгортанні застосунків на хмарних платформах, таких як AWS, дозволяє оптимізувати продуктивність при збереженні безпечної інфраструктури."
                        }
                    }
                },
                {
                    "id": 4,
                    "locales": {
                        "en": {
                            "description": "I thrive in collaborative environments and take pride in promoting best practices in secure coding and agile methodologies. Passionate about developing innovative cybersecurity solutions, I am eager to contribute my skills to a dynamic team."
                        },
                        "he": {
                            "description": "אני פורח בסביבות עבודה שיתופיות וגאה לקדם שיטות עבודה מומלצות בקידוד מאובטח ומתודולוגיות אג'יל. אני נלהב לפתח פתרונות חדשניים בתחום הסייבר ושואף לתרום מכישורי לצוות דינמי."
                        },
                        "pt": {
                            "description": "Desenvolvo-me bem em ambientes colaborativos e tenho orgulho em promover as melhores práticas de codificação segura e metodologias ágeis. Apaixonado por desenvolver soluções inovadoras de cibersegurança, estou ansioso para contribuir com minhas habilidades para uma equipe dinâmica."
                        },
                        "ar": {
                            "description": "أزدهر في بيئات العمل التعاونية وأفتخر بتعزيز أفضل الممارسات في البرمجة الآمنة والمنهجيات الرشيقة. شغوف بتطوير حلول مبتكرة في مجال الأمن السيبراني، أتطلع إلى المساهمة بمهاراتي في فريق ديناميكي."
                        },
                        "ru": {
                            "description": "Я процветаю в совместной среде и горжусь тем, что продвигаю лучшие практики безопасного кодирования и гибких методологий. Увлечён разработкой инновационных решений в области кибербезопасности и стремлюсь внести свой вклад в работу динамичной команды."
                        },
                        "ua": {
                            "description": "Я добре працюю в колаборативних середовищах і пишаюся тим, що просуваю найкращі практики безпечного кодування та гнучкі методології. Пристрасно займаюся розробкою інноваційних рішень у сфері кібербезпеки й прагну застосувати свої навички в динамічній команді."
                        }
                    }
                }
            ]
        }
    ]
}
