{
    "articles": [
        {
            "id": 1,
            "component": "ArticleProfile",
            "settings": {
                "contact_list_ids": [
                    "address",
                    "email",
                    "phone"
                ],
                "contact_circles_ids": [
                    "github",
                    "linkedin",
                    "instagram",
                    "facebook"
                ]
            },
            "items": [
                {
                    "id": 1,
                    "locales": {
                        "en": {
                            "description": "I am a Full-Stack Developer specializing in cybersecurity solutions, QA engineering, and secure software development. With over ten years of experience at IBM, I’ve witnessed the industry’s shift from sample-based defense to proactive, data-driven threat detection."
                        },
                        "he": {
                            "description": "אני מפתח פול-סטאק המתמחה בפתרונות סייבר, הנדסת QA ופיתוח תוכנה מאובטחת. עם יותר מעשר שנות ניסיון ב-IBM, הייתי עד למעבר התעשייה מהגנה מבוססת דגימות לזיהוי איומים פרואקטיבי ומבוסס נתונים."
                        },
                        "pt": {
                            "description": "Sou Desenvolvedor Full-Stack especializado em soluções de cibersegurança, engenharia de QA e desenvolvimento seguro de software. Com mais de dez anos de experiência na IBM, testemunhei a mudança da indústria de uma defesa baseada em amostras para a detecção proativa de ameaças baseada em dados."
                        },
                        "ar": {
                            "description": "أنا مطور Full-Stack متخصص في حلول الأمن السيبراني، هندسة ضمان الجودة، وتطوير البرمجيات الآمنة. مع أكثر من عشر سنوات من الخبرة في IBM، كنت شاهدًا على تحول الصناعة من الدفاع القائم على العينات إلى الكشف الاستباقي عن التهديدات القائم على البيانات."
                        },
                        "ru": {
                            "description": "Я Full-Stack разработчик, специализирующийся на решениях в области кибербезопасности, QA-инжиниринге и безопасной разработке программного обеспечения. С более чем десятью годами опыта в IBM я стал свидетелем перехода отрасли от защиты на основе образцов к проактивному, ориентированному на данные обнаружению угроз."
                        },
                        "ua": {
                            "description": "Я Full-Stack розробник, спеціалізуюся на рішеннях з кібербезпеки, QA-інженерії та безпечній розробці програмного забезпечення. Маючи понад десять років досвіду в IBM, я спостерігав перехід галузі від захисту на основі зразків до проактивного, орієнтованого на дані виявлення загроз."
                        }
                    }
                },
                {
                    "id": 2,
                    "locales": {
                        "en": {
                            "description": "My career began as a Phishing Analyst and Technical Support Engineer, where I manually identified phishing threats, improved detection accuracy, and gained a deep understanding of both customer needs and cybersecurity products. This foundation led me to a QA Engineer role, where I tested live malware, collaborated with researchers and reverse engineers, and built automation frameworks to strengthen security assessments."
                        },
                        "he": {
                            "description": "הקריירה שלי התחילה כאנליסט פישינג ומהנדס תמיכה טכנית, שם זיהיתי איומי פישינג באופן ידני, שיפרתי את דיוק הזיהוי ורכשתי הבנה עמוקה של צורכי הלקוחות ומוצרי הסייבר. בסיס זה הוביל אותי לתפקיד מהנדס QA, שבו בדקתי נוזקות חיות, עבדתי עם חוקרים ומהנדסי רברס ובניתי מסגרות אוטומציה לחיזוק הערכות האבטחה."
                        },
                        "pt": {
                            "description": "Minha carreira começou como Analista de Phishing e Engenheiro de Suporte Técnico, onde identifiquei manualmente ameaças de phishing, melhorei a precisão da detecção e adquiri um entendimento profundo das necessidades dos clientes e dos produtos de cibersegurança. Essa base me levou a um cargo de Engenheiro de QA, onde testei malwares em tempo real, colaborei com pesquisadores e engenheiros de reversão e construí frameworks de automação para reforçar as avaliações de segurança."
                        },
                        "ar": {
                            "description": "بدأت مسيرتي المهنية كمحلل تصيد ومهندس دعم فني، حيث قمت بتحديد تهديدات التصيد يدويًا، وتحسين دقة الاكتشاف، واكتساب فهم عميق لاحتياجات العملاء ومنتجات الأمن السيبراني. هذا الأساس قادني إلى دور مهندس QA، حيث اختبرت برمجيات خبيثة حية، وتعاونت مع الباحثين ومهندسي الهندسة العكسية، وبنيت أطر أتمتة لتعزيز تقييمات الأمان."
                        },
                        "ru": {
                            "description": "Моя карьера началась с должности аналитика фишинга и инженера технической поддержки, где я вручную выявлял фишинговые угрозы, повышал точность обнаружения и глубоко понимал потребности клиентов и продукты кибербезопасности. Эта база привела меня к роли инженера QA, где я тестировал живое вредоносное ПО, сотрудничал с исследователями и реверс-инженерами и создавал фреймворки автоматизации для укрепления оценки безопасности."
                        },
                        "ua": {
                            "description": "Моя кар'єра почалася як аналітик фішингу та інженер технічної підтримки, де я вручну визначав загрози фішингу, підвищував точність виявлення та здобув глибоке розуміння потреб клієнтів і продуктів кібербезпеки. Ця база привела мене до ролі інженера QA, де я тестував активні шкідливі програми, співпрацював із дослідниками та реверс-інженерами і створював фреймворки автоматизації для підвищення оцінки безпеки."
                        }
                    }
                },
                {
                    "id": 3,
                    "locales": {
                        "en": {
                            "description": "Most recently, as a Security Developer, I design and maintain frontend and backend features for AI-driven phishing detection platforms, support large-scale data aggregation and analysis, and troubleshoot production issues for high-pressure financial environments. My work ensures analysts and researchers can respond to threats quickly and effectively."
                        },
                        "he": {
                            "description": "בתפקידי האחרון כמפתח אבטחה אני מעצב ומתחזק רכיבי פרונטאנד ובקאנד עבור פלטפורמות זיהוי פישינג מבוססות AI, תומך באיסוף וניתוח נתונים בקנה מידה גדול ופותר בעיות ייצור בסביבות פיננסיות לחוצות. עבודתי מבטיחה שהאנליסטים והחוקרים יוכלו להגיב לאיומים במהירות וביעילות."
                        },
                        "pt": {
                            "description": "Mais recentemente, como Desenvolvedor de Segurança, projetei e mantenho recursos de frontend e backend para plataformas de detecção de phishing baseadas em IA, apoio a agregação e análise de dados em grande escala e soluciono problemas de produção em ambientes financeiros de alta pressão. Meu trabalho garante que analistas e pesquisadores possam responder rapidamente e de forma eficaz às ameaças."
                        },
                        "ar": {
                            "description": "في دوري الأخير كمطور أمني، أصمّم وأُصون ميزات الواجهة الأمامية والخلفية لمنصات الكشف عن التصيد الاحتيالي المدفوعة بالذكاء الاصطناعي، وأدعم تجميع وتحليل البيانات على نطاق واسع، وأحل مشكلات الإنتاج في بيئات مالية عالية الضغط. يضمن عملي أن يتمكن المحللون والباحثون من الاستجابة للتهديدات بسرعة وفعالية."
                        },
                        "ru": {
                            "description": "В своей последней роли разработчика по безопасности я проектирую и поддерживаю функции фронтенда и бэкенда для платформ обнаружения фишинга на основе ИИ, поддерживаю агрегацию и анализ данных в крупном масштабе и решаю производственные проблемы в условиях высокого давления в финансовой сфере. Моя работа гарантирует, что аналитики и исследователи могут быстро и эффективно реагировать на угрозы."
                        },
                        "ua": {
                            "description": "У своїй останній ролі як розробник безпеки я проектую та підтримую функції фронтенду та бекенду для платформ виявлення фішингу на базі ШІ, підтримую збір та аналіз даних у великому масштабі та вирішую виробничі проблеми у фінансових середовищах під високим тиском. Моя робота забезпечує швидку та ефективну реакцію аналітиків і дослідників на загрози."
                        }
                    }
                },
                {
                    "id": 4,
                    "locales": {
                        "en": {
                            "description": "From entry-level roles to strategic development teams, I’ve developed a strong foundation in software engineering and cybersecurity. I specialize in server-side development with Python, and seamless integration with modern frontend frameworks such as Node.js, Vue.js, and Angular. I combine hands-on experience in phishing detection, malware analysis, and full-stack development to deliver secure, reliable solutions in fast-moving, collaborative environments. Driven by a passion for innovative cybersecurity, I thrive on tackling complex challenges with creativity, precision, and a focus on real-world impact."
                        },
                        "he": {
                            "description": "מהתפקידים הראשוניים ועד לצוותי הפיתוח האסטרטגיים, פיתחתי בסיס חזק בהנדסת תוכנה וסייבר. אני מתמחה בפיתוח צד שרת ב-Python ובשילוב חלק עם מסגרות פרונטאנד מודרניות כמו Node.js, Vue.js ו-Angular. עם ניסיון מעשי בזיהוי פישינג, ניתוח נוזקות ופיתוח פול-סטאק, אני מספק פתרונות מאובטחים ואמינים בסביבות דינמיות ושיתופיות. נלהב מפתרונות חדשניים בתחום הסייבר, אני פורץ דרך באתגרים מורכבים עם יצירתיות, דיוק ומיקוד בהשפעה בעולם האמיתי."
                        },
                        "pt": {
                            "description": "Desde funções iniciais até equipes de desenvolvimento estratégicas, desenvolvi uma base sólida em engenharia de software e cibersegurança. Especializo-me em desenvolvimento do lado do servidor com Python e integração perfeita com frameworks modernos de frontend, como Node.js, Vue.js e Angular. Com experiência prática em detecção de phishing, análise de malware e desenvolvimento full-stack, entrego soluções seguras e confiáveis em ambientes colaborativos e dinâmicos. Movido pela paixão por cibersegurança inovadora, prospero ao enfrentar desafios complexos com criatividade, precisão e foco no impacto real."
                        },
                        "ar": {
                            "description": "من الأدوار المبتدئة إلى فرق التطوير الاستراتيجية، طورت أساسًا قويًا في هندسة البرمجيات والأمن السيبراني. أتخصص في تطوير جانب الخادم باستخدام Python والتكامل السلس مع أطر عمل حديثة للواجهة الأمامية مثل Node.js وVue.js وAngular. مع خبرة عملية في اكتشاف التصيد الاحتيالي وتحليل البرمجيات الخبيثة والتطوير الكامل للتطبيقات، أقدم حلولًا آمنة وموثوقة في بيئات ديناميكية وتعاونية. مدفوع بشغف للأمن السيبراني المبتكر، أتفوق في مواجهة التحديات المعقدة بالإبداع والدقة والتركيز على التأثير الواقعي."
                        },
                        "ru": {
                            "description": "От начальных ролей до стратегических команд разработки я создал прочную основу в области программной инженерии и кибербезопасности. Я специализируюсь на серверной разработке с Python и бесшовной интеграции с современными фронтенд-фреймворками, такими как Node.js, Vue.js и Angular. С практическим опытом в обнаружении фишинга, анализе вредоносного ПО и full-stack разработке, я предоставляю безопасные и надежные решения в динамичных и совместных средах. Вдохновленный инновациями в области кибербезопасности, я успешно решаю сложные задачи с креативностью, точностью и фокусом на реальном эффекте."
                        },
                        "ua": {
                            "description": "Від початкових посад до стратегічних команд розробників я створив міцний фундамент у програмній інженерії та кібербезпеці. Я спеціалізуюся на серверній розробці з Python та безшовній інтеграції з сучасними фронтенд-фреймворками, такими як Node.js, Vue.js та Angular. Маючи практичний досвід у виявленні фішингу, аналізі шкідливого ПЗ та full-stack розробці, я надаю безпечні та надійні рішення у динамічних та колаборативних середовищах. Натхненний інноваційною кібербезпекою, я успішно вирішую складні завдання з креативністю, точністю та орієнтацією на реальний вплив."
                        }
                    }
                }
            ]
        }
    ]
}